# UnableToUpgradeAnalyticalElementGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..UnableToUpgradeAnalyticalElementGeometry Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Unable to upgrade analytical element with incorrect geometry. To keep the elements, open Revit 2022 and correct the elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToUpgradeAnalyticalElementGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToUpgradeAnalyticalElementGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToUpgradeAnalyticalElementGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace